<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Imagedatei erstellen</title>
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="global.css">
  <script language="JavaScript" type="text/javascript" src="Global.js"></script>
  <meta name="keywords" content="Men&uuml;, Extras, Imagedatei erstellen">
</head>
<body>
<Object type="application/x-oleobject" classid="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
	<param name="Keyword" value="Men&uuml;">
  <param name="Keyword" value="Extras">
  <param name="Keyword" value="Imagedatei erstellen">
</OBJECT>
  
<p class="content">
Men&uuml;: &nbsp; <b>Extras</b> | <b>Imagedateien</b> | <b>Imagedatei erstellen</b>
</p>

<h1>Imagedatei erstellen</h1>

<p>
In diesem Dialog k&ouml;nnen Sie neue, leere Disketten- und Festplattenimage-Dateien
erstellen. Diese Imagedateien k&ouml;nnen dann &uuml;ber die
<a href="ProfileEditDrives.html">Laufwerke</a>-Dialogseite des
<a href="ProfileEdit.html">Profileditor</a>-Dialogs als Laufwerke in DOSBox eingebunden werden.
</p>

<h3>Diskettenimages</h3>

<p>
Auf dieser Dialogseite k&ouml;nnen Sie Diskettenimages jedes denkbaren Diskettentyps
erstellen. Daf&uuml;r k&ouml;nnen Sie entweder aus dem Auswahlfeld "Disketten-Typ"
einen der vordefinierten Diskettentypen auswh&auml;len oder aber &uuml;ber die darunter
befindlichen Felder den Diskettentyp frei definieren.
</p>

<ul class="big">
  <li><b>Imagedatei im NTFS-Dateisystem komprimieren</b><br />
  Wenn diese Option aktiviert ist, wird das Image als komprimierte
  Datei gespeichert. Dies bedeutet, dass die Datei nur soviel Platz
  auf dem Datentr&auml;ger belegt, wie wirklich zum Speichern der in
  dem Image abgelegten Dateien notwenidg ist. Die leeren Sektoren innerhalb
  des Images belegen fast keinen Platz. Die Kompression erfolgt durch den
  Windows-Festplattentreiber, d.h. Sie k&ouml;nnen mit der komprimierten
  Datei normal arbeiten, ohne ein (De-)Kompressionsprogramm verweden zu m&uuml;ssen.
  </li>
  <li><b>Diskettenimage bootf&auml;hig machen</b><br />
  Wenn diese Option aktiviert ist, &uuml;bertr&auml;gt D-Fend Reloaded die
  FreeDOS Boot-Dateien auf das Diskettenimage und erstellt einen
  Bootsektor auf dem Diskettenimage, welches es bootf&auml;hig macht.
  (Um diese Option verwenden zu k&ouml;nnen, muss FreeDOS installiert und
  der Pfad zu FreeDOS auf der Dialogseite
  <a href="FileOptionsFreeDOS.html">FreeDOS</a> des
  the <a href="FileOptions.html">Programmeinstellungen</a>-Dialogs
  eingetragen sein.)
  </li>
  <li><b>Die DOSBox-Tastaturbelegung auf der Bootdiskette verwenden</b><br />
  Wenn diese Option aktiviert ist, &uuml;bertr&auml;gt D-Fend Reloaded
  den FreeDOS-Tastaturtreiber auf die Bootdiskette und f&uuml;gt eine Zeile
  in die <tt>autoexec.bat</tt>-Datei auf der Bootdiskette ein,
  um das Tastaturlayout, welche in der in D-Fend Reloaded gew&auml;hlten
  Sprachdatei definiert ist, zu aktivieren.
  </li>
  <li><b>Maustreiber auf der Bootdisk einbinden</b><br />
  Wenn diese Option aktiviert ist, &uuml;bertr&auml;gt D-Fend Reloaded
  den FreeDOS-Maustreiber auf die Bootdiskette und f&uuml;gt eine Zeile
  in die <tt>autoexec.bat</tt>-Datei auf der Bootdiskette ein, um ihn
  beim Starten des Diskettenimages zu aktivieren.
  </li>  
</ul>

<h3>Festplattenimages</h3>

<p>
From this dialog page you can create hard disk images of any size.
D-Fend Reloaded will choose the right drive geometry automatically for you.
</p>

<ul class="big">
  <li><b>Imagedatei im NTFS-Dateisystem komprimieren</b><br />
  Wenn diese Option aktiviert ist, wird das Image als komprimierte
  Datei gespeichert. Dies bedeutet, dass die Datei nur soviel Platz
  auf dem Datentr&auml;ger belegt, wie wirklich zum Speichern der in
  dem Image abgelegten Dateien notwenidg ist. Die leeren Sektoren innerhalb
  des Images belegen fast keinen Platz. Die Kompression erfolgt durch den
  Windows-Festplattentreiber, d.h. Sie k&ouml;nnen mit der komprimierten
  Datei normal arbeiten, ohne ein (De-)Kompressionsprogramm verweden zu m&uuml;ssen.
  </li>
  <li><b>Typ der Imagedatei</b><br />
  Da vorformatierte Festplatten-Images in DOSBox nicht bootf&auml;hig
  gemacht werden k&ouml;nnen, k&ouml;nnen Sie in dieser Auswahlbox optional
  angeben, dass ein leeres, unformartiertes Festplatten-Image erstellt werden
  soll. In diesem Fall m&uuml;ssen Sie in DOSBox von einem bootf&auml;higen
  Diskettenimage booten und das neu erststellte Festplatten-Image partitionieren
  und formatieren. (Diese dazu auch die Beschreibung zum Erstellen von bootf&auml;higen
  Festplatten-Images in den <a href="FAQ.html#FAQ10">FAQs</a>.)
  </li>
</ul>

<p>&nbsp;</p>

<p class="smallH">Siehe auch:</p>
<p class="smallT">
  <a href="ProfileEditDrives.html">"Laufwerke" Dialogseite des Profileditors</a>
</p>

</body>
</html>